#pragma once
#pragma pack( push, 1 )

//size asdf
class CSharedPartyData
{
public:
	/* 00 */ LPVOID _vt;
	/* 08 */ FVector pos;
	/* 20 */ INT32 _unkn20;
	/* 24 */ INT32 _unkn24;
	/* 28 */ INT32 _unkn28;
	/* 2C */ INT32 _unkn2C;
	/* 30 */ INT32 _unkn30;
	/* 34 */ INT32 _unkn34;
	/* 38 */ INT32 _unkn38;
	/* 3C */ INT32 _unkn3C;
	/* 40 */ INT32 _unkn40;
	/* 44 */ INT32 _unkn44;
	/* 48 */ INT32 _unkn48;
	/* 4C */ INT32 _unkn4C;
	/* 50 */ INT32 _unkn50;
	/* 54 */ INT32 _unkn54;
	/* 58 */ INT32 _unkn58;
	/* 5C */ INT32 _unkn5C;
	/* 60 */ INT32 _unkn60;
	/* 64 */ INT32 _unkn64;
	/* 68 */ INT32 _unkn68;
	/* 6C */ INT32 _unkn6C;
	/* 70 */ UINT partyLeaderId;
	/* 74 */ INT32 _unkn74;
	/* 78 */ INT32 _unkn78;
	/* 7C */ INT32 _unkn7C;
};

#pragma pack( pop )